#+TITLE:  Tagless encoding of expressions
#+AUTHOR: Simon Beaumont 
#+EMAIL:  datalligator@icloud.com
#+STARTUP: inlineimages overview indent latexpreview

*** The representation is a parameter
#+begin_src haskell
  expf = add (lit 23) (lit 20)
  :t expf
#+end_src

#+RESULTS:
: expf :: ExpS repr => repr

* So e.g. a pretty printer

#+begin_src haskell :tangle yes
  instance ExpS String where
    lit n = show n
    add e1 e2 = "(" <> e1 <> " + " <> e2 <> ")"
#+end_src

With the associated /selector/ function 

#+begin_src haskell :tangle yes
  pprint :: String -> String
  pprint = id
#+end_src

#+begin_src haskell :type verbatim
  pprint $ add (lit 23) (lit 20)
#+end_src

#+RESULTS:
| 23 | + | 20 |

*** We can immediately write new expressions:

#+begin_src haskell
  expf2 = mul (lit 2) (add (lit 23) (lit 20))
  :t expf2
#+end_src

#+RESULTS:
: expf2 :: (ExpMulS repr, ExpS repr) => repr

*** And extend our interpreters:

#+begin_src haskell :tangle yes
  instance ExpMulS Int where
    mul e1 e2 = e1 * e2
  instance ExpMulS String where
    mul e1 e2 = "(" <> e1 <> " * " <> e2 <> ")"
#+end_src
Such that the type inference works!
#+begin_src haskell :type verbatim
  eval' expf2
#+end_src

#+RESULTS:
: 86
#+begin_src haskell :type verbatim 
  pprint expf2
#+end_src
#+RESULTS:
| 2 | * | (23 + 20) |

